[Reference](https://medium.com/analytics-vidhya/data-cleaning-in-python-using-pandas-41b8f5822b67)

In [5]:
import pandas as pd
import numpy as np

# Dropping Missing Values

In [6]:
frame = pd.DataFrame(np.random.randn(4,3), index=[1,2,4,7], columns=['A','B','C'])
print(frame.reindex([1,2,3,4,5,6,7]))

          A         B         C
1 -0.585957 -1.652115 -1.069290
2  0.692501 -1.721815  0.532791
3       NaN       NaN       NaN
4  0.151714 -0.234842  2.591092
5       NaN       NaN       NaN
6       NaN       NaN       NaN
7 -0.488079  0.916492 -2.027172

In [7]:
frame.dropna()

          A         B         C
1 -0.585957 -1.652115 -1.069290
2  0.692501 -1.721815  0.532791
4  0.151714 -0.234842  2.591092
7 -0.488079  0.916492 -2.027172

# Replacing Missing Values

In [8]:
from numpy import NaN

In [10]:
print(frame.replace({NaN: 0.00}))

          A         B         C
1 -0.585957 -1.652115 -1.069290
2  0.692501 -1.721815  0.532791
4  0.151714 -0.234842  2.591092
7 -0.488079  0.916492 -2.027172

# Replacing with a Scalar Value

In [11]:
frame.fillna(7)

          A         B         C
1 -0.585957 -1.652115 -1.069290
2  0.692501 -1.721815  0.532791
4  0.151714 -0.234842  2.591092
7 -0.488079  0.916492 -2.027172

# Filling Forward or Backward

In [12]:
frame.fillna(method='pad')

          A         B         C
1 -0.585957 -1.652115 -1.069290
2  0.692501 -1.721815  0.532791
4  0.151714 -0.234842  2.591092
7 -0.488079  0.916492 -2.027172